test/non-functional/gatling/src/test/resources/bodies/GetCareContactsRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:riv:itintegration:registry:1" xmlns:urn1="urn:riv:clinicalprocess:logistics:logistics:GetCareContactsResponder:2" xmlns:urn2="urn:riv:clinicalprocess:logistics:logistics:2">
   <soapenv:Header>
      <urn:LogicalAddress>VS-1</urn:LogicalAddress>
   </soapenv:Header>
   <soapenv:Body>
      <urn1:GetCareContacts>
         <!--Zero or more repetitions:-->
         <urn1:careUnitHSAId>${careUnitHSAId}</urn1:careUnitHSAId>
         <urn1:patientId>
            <urn2:id>192712029550</urn2:id>
            <urn2:type>?</urn2:type>
         </urn1:patientId>
         <!--Optional:-->
         <urn1:sourceSystemHSAId>?</urn1:sourceSystemHSAId>
         <!--Zero or more repetitions:-->
         <urn1:careContactId>?</urn1:careContactId>
         <!--You may enter ANY elements at this point-->
      </urn1:GetCareContacts>
   </soapenv:Body>
</soapenv:Envelope>